vehar/STM32L15x_prj_new/AN3413-Current_consumption_touch_sensing/src/main.c
/**
  ******************************************************************************
  * @file    main.c
  * @author  Vladyslav
  * @version V1.0
  * @date    September 2014
  * @brief   Main program body
  ******************************************************************************

 //Includes ------------------------------------------------------------------*/

 //Standard STM32L1xxx driver headers 
#include "misc.h"
#include "main.h"
#include "stm32l1xx_adc.h"
#include "stm32l1xx_rcc.h"
#include "stm32l1xx_rtc.h"
#include "stm32l1xx_exti.h"
#include "stm32l1xx_pwr.h"
#include "stm32l1xx_syscfg.h"
#include "stm32l1xx_dbgmcu.h"


 //discovery board and specific drivers headers*/
#include "discover_board.h"
#include "icc_measure.h"
#include "discover_functions.h"

#include <Cust_encoder.h>
#include <Cust_MatrKeypad.h>
    
#include "CustADC.h"
#include "CustI2C.h"
#include "CustGps.h"    

#define DEBUG


/* Private variables ---------------------------------------------------------*/
bool majorInterrupt = false;
/*******************************************************************************/

static volatile uint32_t TimingDelay;
extern unsigned char Bias_Current;     //Bias Current stored in EІProm used for ICC mesurement precision 
//extern uint8_t t_bar[2];               //LCD bar graph: used for displaying active function 
extern bool Auto_test;                 //Auto_test activation flag: set by interrupt handler if user button is pressed for a few seconds 
extern bool Idd_WakeUP;                //*/
extern volatile bool KeyPressed;       //*/
extern bool UserButton;                //Set by interrupt handler to indicate that user button is pressed  
uint8_t state_machine = 0;                 //Machine status used by main() wich indicats the active function, set by user button in interrupt handler 
uint16_t Int_CurrentSTBY;              //*/


void All_init(void)
{
    SystemInit();
    //HSI_on_16MHz(); 
    All_clk_On(); 
 //Timer2_init_vs_irq(); //ovr_irq

/******Btn`s init_section******/  
    Init_GPIOs();    //Init leds, user btn, enc btn

 Button_init_vs_irq();   
 Matrix_kbd_init();
 
/****Encoder init_section****/    
 encoder_init(); 
 
/****Interface init_section****/  
 Usart_init_vs_irq ();
 Spi2_init_vs_irq  (); //2- slave, 1- mstr
 
 ///i2c1_init();///i2c1_rx(0xA0);
   //ADC_Icc_Init();   //Initializes ADC 
 ADC_init();

  enableInterrupts();	   //Enable General interrupts 
} 


void Debug_section(void){
 //**********Debug section***************//
 //*************************************//
   //  ADC_measure(10);  /*!< Start Conversion of regular channels */
   //   ADC_measure(11);
    //   ADC_measure(16);
// send_str_u(  (char*)NVIC_GetPriority (EXTI0_IRQn));
 //spi_exchange(send_data); 
 //send_data = 0x05;
 
  send_str_u("===STM_GO!===\n");
 
 
Get_key();

//*************************************//
//**********Debug section***************/  
}




char out_data_t = 0; //tmp debug



/*******************************************************************************/
/**
  * @brief main entry point.
  * @par Parameters None
  * @retval void None
  * @par Required preconditions: None
*/  
int main(void)
{ 
 // bool StanbyWakeUp ;
 // float Current_STBY;
     
 /*!< At this stage the microcontroller clock setting is already configured, 
       this is done through SystemInit() function which is called from startup
       file (startup_stm32l1xx_md.s) before to branch to application main.
       To reconfigure the default setting of SystemInit() function, refer to
       system_stm32l1xx.c file
 */     
 
 //////////////////////////////////////////////////////////////////////////////////
 ///////////////////////On-StartTestSection_start////////////////////////////////// 
 
  RCC_Configuration();   //Configure Clocks for Application need 
  PWR_VoltageScalingConfig(PWR_VoltageScaling_Range1);    //Set internal voltage regulator to 1.8V 
  while (PWR_GetFlagStatus(PWR_FLAG_VOS) != RESET) ;   //Wait Until the Voltage Regulator is ready 
  
 ///////////////////////On-StartTestSection_end//////////////////////////////////// 
 //////////////////////////////////////////////////////////////////////////////////


  
  All_init();
  Debug_section();
  
  /*Until application reset*/
  while (1)
  {
    
  OutData.encoder_state = Encoder_proc();
  OutData.btn_state |= Get_key();
 
  if((OutData.encoder_state)||(OutData.btn_state))
  {
    OutData.flags |= ANY_DATA; //есть, что отправить
    SPI2->DR = OutData.encoder_state; //To DM
    SPI2->DR = OutData.btn_state; //To DM
    send_to_usart(OutData.encoder_state); //debug 
    send_to_usart(OutData.btn_state); //debug 
    OutData.flags |= OUT_DATA_SENDED; //отправлено, можно очищать буффер!
  }  
   

//button_port = GPIOC->IDR;  
//send_to_usart(button_port>>8);
 
  
    ///////////////////////////////////////////////////////--------------------
     //Вызов функции обмена данными.
    //В качестве аргумента поочередно передаются значения 0x01 или 0x03
 
       //spi_exchange(send_data); 
    //SPI2->DR = Encoder_curr_pos; //Пишем в буфер передатчика SPI2 
   // send_to_usart(Encoder_curr_pos);
 //   SPI1->DR = 0x05+512; //Пишем в буфер передатчика SPI1. После этого стартует обмен данными
                     //всё остальное в прерывании
   //spi_exchange(send_data);  
    switch(temp)
    {/*Если SPI1 принял 0x01, зажигаем соответствующий светодиод, 
      и меняем значение аргумента, передаваемого функции обмена данными
      при следующем вызове на 0x03*/
    case 0x01:
      //GPIOB->BSRRH |= GPIO_BSRR_BS_7;
      //GPIOB->BSRRL |= GPIO_BSRR_BS_6;
      send_str_u("SPI=01");
      send_data = 0x03;
      break;
      /*Если SPI1 принял 0x03, зажигаем соответствующий светодиод, 
      и меняем значение аргумента, передаваемого функции обмена данными
      при следующем вызове на 0x01*/
    case 0x03:
      //GPIOB->BSRRH |= GPIO_BSRR_BS_6;
      //GPIOB->BSRRL |= GPIO_BSRR_BS_7;
       send_str_u("SPI=03");
      send_data = 0x01;
      break;     
     default :  //GPIOB->BSRRH |= GPIO_BSRR_BS_7;
    }
    //////////////////////////////////////////////////////////////-------------------
//delay(1000);

#ifdef DEBUG  
  delay(100000); //+0 
#endif  
  //send_to_usart(temp);
 //   if (USART1->SR & USART_SR_RXNE) {usart_data=USART1->DR;  
  //switch(usart_data)  {
 switch(usart_data)  {
    case '1':
       Info(); 
       break;
    case '2':
       Timer2_init_vs_irq(); //ADC_measure(10);  //every second ad-conventiuon flag (in irq)setts
       break;
    case '3':
       GPS_get_data();      
       break;
    case '4':
       Current_monitor_get_data();
       break;     
    case '5':
        SET(ADC_start_flag);  /*!< Start Conversion of regular channels */
       break;
    case '6':
        send_str_u("===HELLO_FROM_USART!===");
      break;
      case '7':
        SPI2->DR=0xABCD;
      break;
       case '8':  //Keybord_debug
  //pressed_key = Get_key();    
  //send_to_usart(pressed_key);
 
      break;
     //default :    send_str_u("Invalid_comand!");
 }
 
 
