vehar/STM32L15x_prj_new/AN3413-Current_consumption_touch_sensing/src/main.c
 /*
  if(strcmp(UsartRxBuffer,"led0")==0) //Если пришла команда "led0"
   {
    GPIOB->BSRRH |= GPIO_BSRR_BS_6;  // Reset PB6 bit
   }
 if(strcmp(UsartRxBuffer,"led1")==0) //Если пришла команда "led1"
   {
     GPIOB->BSRRL |= GPIO_BSRR_BS_6;   // Set PB6 bit
   }
*/ 

     //    }
          
    //  if (A_flag){  GPIOB->ODR ^= GPIO_ODR_ODR_6  ;  } // 
    //  RESET(A_flag);
         
         
//flag state machine
 if(ADC_start_flag)    { ADC_measure(10); ADC_measure(11); RESET(ADC_start_flag);} 
 if(Get_current_flag)  { Get_current(); RESET(Get_current_flag);} 
 if(Get_RTC_flag)      { Get_time(); RESET(Get_RTC_flag);} 
 
 
 //End of main cycle
 //Cleaning all buffers 
  if(UsartRxBuffer[0]!=0)
  {
      // send_str_u(UsartRxBuffer); //return to console
       memset(UsartRxBuffer, 0, sizeof(UsartRxBuffer)); //clearing buffer
       usart_data=0;
       usart1_rx_bit=0; //reset counter
  }
   if(spi1_buf[0]!=0)
  {
       memset(spi1_buf, 0, sizeof(spi1_buf)); //Очищаем буфер
       spi1_data=0;
       spi1_bit=0; //Сбрасываем счетчик
  } 
 
 //if ((OutData.flags == ANY_DATA) && (OutData.flags == OUT_DATA_SENDED))
  if (OutData.flags == (ANY_DATA + OUT_DATA_SENDED))
 {   
   OutData.flags = 0;
   OutData.btn_state = 0;
   OutData.encoder_state = 0;
   OutData.current_state = 0;
   OutData.voltage_state = 0;
 }
    
  }//End While(1)
} //End main()		


/**
  * @brief  Configures the different system clocks.
  * @param  None
  * @retval None
 */ 
void RCC_Configuration(void)
{  
  RCC_HSICmd(ENABLE);//Enable HSI Clock  
  while (RCC_GetFlagStatus(RCC_FLAG_HSIRDY) == RESET);//!< Wait till HSI is ready  
  RCC_SYSCLKConfig(RCC_SYSCLKSource_HSI); //Set HSI as sys clock   
  RCC_MSIRangeConfig(RCC_MSIRange_6);//Set MSI clock range to ~4.194MHz*/  
   //Enable the GPIOs clocks 
  RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOA | RCC_AHBPeriph_GPIOB | RCC_AHBPeriph_GPIOC| RCC_AHBPeriph_GPIOD| RCC_AHBPeriph_GPIOE| RCC_AHBPeriph_GPIOH, ENABLE);      
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_COMP |  RCC_APB1Periph_PWR , ENABLE);   //Enable comparator and PWR mngt clocks
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_ADC1 | RCC_APB2Periph_SYSCFG , ENABLE);//Enable ADC & SYSCFG clocks  
  PWR_RTCAccessCmd(ENABLE);//Allow access to the RTC 
   //Reset RTC Backup Domain 
  RCC_RTCResetCmd(ENABLE);
  RCC_RTCResetCmd(DISABLE);   
  RCC_LSEConfig(RCC_LSE_ON);//LSE Enable  
  while (RCC_GetFlagStatus(RCC_FLAG_LSERDY) == RESET);//Wait until LSE is ready    
  RCC_RTCCLKConfig(RCC_RTCCLKSource_LSE); //RTC Clock Source Selection  
  RCC_RTCCLKCmd(ENABLE);   //Enable the RTC   
  RCC_HSEConfig(RCC_HSE_OFF);  /*Disable HSE*/
  if(RCC_GetFlagStatus(RCC_FLAG_HSERDY) != RESET )
  {    
    while(1); //Stay in infinite loop if HSE is not disabled*/
  }
}


 void DeInit_GPIOs(void)
{
  GPIO_DeInit(GPIOA);
  GPIO_DeInit(GPIOB);
  GPIO_DeInit(GPIOC);
  GPIO_DeInit(GPIOD);
}


/**
  * @brief  To initialize the I/O ports
  * @caller main
  * @param None
  * @retval None
 */ 
void  Init_GPIOs (void)
{
   //GPIO, EXTI and NVIC Init structure declaration 
  GPIO_InitTypeDef GPIO_InitStructure;
  EXTI_InitTypeDef EXTI_InitStructure;
  NVIC_InitTypeDef NVIC_InitStructure;
  
 DeInit_GPIOs();
 
   //Configure User Button pin as input 
#ifdef DEBUG
    GPIO_InitStructure.GPIO_Pin = USERBUTTON_GPIO_PIN;
#endif
  GPIO_InitStructure.GPIO_Pin |=  ENCODERBTN_GPIO_PIN;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN;
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_DOWN;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIO_Init(USERBUTTON_GPIO_PORT, &GPIO_InitStructure);

   //Select User Button pin as input source for EXTI Line 
#ifdef DEBUG
  SYSCFG_EXTILineConfig(EXTI_PortSourceGPIOA, EXTI_PinSource0);
#else 
  SYSCFG_EXTILineConfig(EXTI_PortSourceGPIOA, EXTI_PinSource5);
#endif
   //Configure EXT1 Line 0 in interrupt mode trigged on Rising edge 
#ifdef DEBUG
  EXTI_InitStructure.EXTI_Line = EXTI_Line0;  // PA0 for User button AND IDD_WakeUP
#endif
  EXTI_InitStructure.EXTI_Line |=  EXTI_Line5;  // 
  EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
  EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Rising;  
  EXTI_InitStructure.EXTI_LineCmd = ENABLE;
  EXTI_Init(&EXTI_InitStructure);

   //Enable and set EXTI0 Interrupt to the lowest priority 
#ifdef DEBUG
  NVIC_InitStructure.NVIC_IRQChannel = EXTI0_IRQn;
#endif
  NVIC_InitStructure.NVIC_IRQChannel |=  EXTI9_5_IRQn;
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0x0F;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0x0F;
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_InitStructure); 

  //Разрешаем оба прерывания
#ifdef DEBUG
NVIC_EnableIRQ (EXTI0_IRQn);
#endif
NVIC_EnableIRQ (EXTI9_5_IRQn);
  
#ifdef DEBUG  
   //Configure the LED_pin as output push-pull for LD3 & LD4 usage
  GPIO_InitStructure.GPIO_Pin = LD_GREEN_GPIO_PIN | LD_BLUE_GPIO_PIN;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIO_Init(LD_GPIO_PORT, &GPIO_InitStructure); 
   //Force a low level on LEDs*/ 
 // GPIO_LOW(LD_GPIO_PORT,LD_GREEN_GPIO_PIN);	
 // GPIO_LOW(LD_GPIO_PORT,LD_BLUE_GPIO_PIN);
#endif 
/*    
 //Counter enable: GPIO set in output for enable the counter 
  GPIO_InitStructure.GPIO_Pin = CTN_CNTEN_GPIO_PIN;
  GPIO_Init( CTN_GPIO_PORT, &GPIO_InitStructure);
  
 //To prepare to start counter 
  GPIO_HIGH(CTN_GPIO_PORT,CTN_CNTEN_GPIO_PIN);
  */
/*      
 //Configure Port A LCD Output pins as alternate function 
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_1 | GPIO_Pin_2 ;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_Init( GPIOA, &GPIO_InitStructure);
  
 //Select LCD alternate function for Port A LCD Output pins 
  GPIO_PinAFConfig(GPIOA, GPIO_PinSource1,GPIO_AF_LCD) ;
  GPIO_PinAFConfig(GPIOA, GPIO_PinSource2,GPIO_AF_LCD) ;
  
   //Configure Port B LCD Output pins as alternate function  
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_3 | GPIO_Pin_4 ;  
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_Init( GPIOB, &GPIO_InitStructure);
  
