vehar/STM32L15x_prj_new/AN3413-Current_consumption_touch_sensing/src/main.c
   //Select LCD alternate function for Port B LCD Output pins 
  GPIO_PinAFConfig(GPIOB, GPIO_PinSource3,GPIO_AF_LCD) ;
  GPIO_PinAFConfig(GPIOB, GPIO_PinSource4,GPIO_AF_LCD) ;
  
   //Configure Port C LCD Output pins as alternate function  
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0 | GPIO_Pin_1  ;                               
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_Init( GPIOC, &GPIO_InitStructure);  

   //Select LCD alternate function for Port B LCD Output pins 
  GPIO_PinAFConfig(GPIOC, GPIO_PinSource0,GPIO_AF_LCD) ;
  GPIO_PinAFConfig(GPIOC, GPIO_PinSource1,GPIO_AF_LCD) ; 
 */ 
  
  /*
   //Configure ADC (IDD_MEASURE) pin as Analogue 
  GPIO_InitStructure.GPIO_Pin = IDD_MEASURE  ;                               
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AN;
  GPIO_Init( IDD_MEASURE_PORT, &GPIO_InitStructure);
  */
}  



/******************* (C) COPYRIGHT 2011 STMicroelectronics *****END OF FILE****/

//My funktions_start
void HSI_on_16MHz (void){
   /*  в качестве источника тактирования внутренний генератор HSI с частотой 16 Мгц. */  
  RCC->CR |= RCC_CR_HSION; //Включаем тактовый генератор HSI
  while(!(RCC_CR_HSION)); //Ждем его стабилизации
  RCC->CFGR |= RCC_CFGR_SW_HSI; //Выбираем источником тактовой частоты SYSCLK генератор HSI
  RCC->CR &= ~RCC_CR_MSION; //Отключаем генератор MSI.   
}

void All_clk_On(void){ //тактирование портов ввода-вывода и периферии
  RCC->AHBENR  |= RCC_AHBENR_GPIOAEN | RCC_AHBENR_GPIOBEN | RCC_AHBENR_GPIOCEN;
  RCC->APB1ENR |= RCC_APB1ENR_PWREN | RCC_APB1ENR_I2C1EN | RCC_APB1ENR_I2C2EN | RCC_APB1ENR_USART2EN | RCC_APB1ENR_SPI2EN ;
  RCC->APB2ENR |= RCC_APB2ENR_USART1EN | RCC_APB2ENR_SPI1EN;
}


void Timer2_init_vs_irq(void){
     RCC->APB1ENR |= RCC_APB1ENR_TIM2EN;  // Enable TIM2 Periph clock
     
    TIM2->PSC = SystemCoreClock / 1000 - 1; // 1000 tick/sec
    TIM2->ARR = 100;  // 1 Interrupt/0.1 sec
  
    TIM2->DIER |= TIM_DIER_UIE; // Enable tim2 interrupt
    TIM2->CR1 |= TIM_CR1_CEN;   // Start count
    
  //  NVIC_SetPriority(TIM2_IRQn, 1);
    NVIC_EnableIRQ(TIM2_IRQn);  // Enable IRQ 
}


void Button_init_vs_irq (void){
   RCC->AHBENR  |= RCC_AHBENR_GPIOAEN; //enable gpioA
   RCC->APB2ENR |= RCC_APB2ENR_SYSCFGEN;  /*!< System Configuration SYSCFG clock enable */
  /// GPIOA->CRH |=  GPIO_CRH_MODE0_1;
   //GPIOA->PUPDR |=  GPIO_PUPDR_PUPDR0_1; //BUTTON F in - pull down
   
  /// SYSCFG->EXTICR1 |= SYSCFG_EXTICR1_EXTI1 | SYSCFG_EXTICR1_EXTI1_PA;//?
   
   EXTI->EMR |= EXTI_EMR_MR0 ;// PIN 0     
   EXTI->IMR |= EXTI_IMR_MR0; //для выводов 0 
   EXTI->FTSR|= EXTI_FTSR_TR0 ; //конфигурация - по падающему фронту
   
    
   ///SYSCFG->EXTICR[0] |= SYSCFG_EXTICR1_EXTI0_PA; // Connect EXTI line 0 to PA.0//?
  /// RCC->APB2ENR |= RCC_APB2ENR_SYSCFGEN;
   
   NVIC_EnableIRQ(EXTI0_IRQn); // Enable IRQn
}


//////////////



void Info(){
send_str_u(VERSION);  
send_str_u(DATE);
}

void GPS_get_data(void){

ParseGpsData();  
  
send_str_u("GPS");
send_str_u((uint8_t *) &gpsData);

 //spi1_buf = (uint8_t *) &gpsData;
 //spi1_rx_buf_size = gpsDataSize;
}


//160521.109,0000.0000,N,00000.0000,E




void Current_monitor_get_data(void){
send_str_u("Current_monitor_get_data");  
  
}

void delay (int a)
{
    volatile int i,j;
    for (i=0 ; i < a ; i++)
    {
        j++;
    }
    return;
}

enum rcc_cfgr_mco_select
{
	RCC_CFGR_MCOSEL_DISABLED = 0,
	RCC_CFGR_MCOSEL_SYSCLK = RCC_CFGR_MCOSEL_0,
	RCC_CFGR_MCOSEL_HSI = RCC_CFGR_MCOSEL_1,
	RCC_CFGR_MCOSEL_MSI = RCC_CFGR_MCOSEL_1 | RCC_CFGR_MCOSEL_0,
	RCC_CFGR_MCOSEL_HSE = RCC_CFGR_MCOSEL_2,
	RCC_CFGR_MCOSEL_PLL = RCC_CFGR_MCOSEL_2 | RCC_CFGR_MCOSEL_0,
	RCC_CFGR_MCOSEL_LSI = RCC_CFGR_MCOSEL_2 | RCC_CFGR_MCOSEL_1,
	RCC_CFGR_MCOSEL_LSE = RCC_CFGR_MCOSEL_2 | RCC_CFGR_MCOSEL_1
			| RCC_CFGR_MCOSEL_0
};




void i2c1_init(){
  
  RCC->AHBENR |= RCC_AHBENR_GPIOBEN;
  RCC->APB1ENR |= RCC_APB1ENR_PWREN | RCC_APB1ENR_I2C1EN;
  
  PIN_CONFIGURATION(PIN_I2C1_SCL);
  PIN_CONFIGURATION(PIN_I2C1_SDA);
        
  	// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
  
            I2C1->CR2 |= I2C_CR2_ITBUFEN;  /*!< Buffer Interrupt Enable */
            I2C1->CR2 |= I2C_CR2_ITEVTEN;  /*!< Event Interrupt Enable */
                           
	// текущее значение частоты PCLK1 (от 2 до 32, включительно)
	I2C1->CR2 &= ~I2C_CR2_FREQ;
	I2C1->CR2 |= 32;
	// установка частоты обмена
	I2C1->CCR &= ~I2C_CCR_CCR;
	I2C1->CCR |= 10;
	// время установки сигнала
	I2C1->TRISE = 3;
}

  uint8_t eeprom_data;
void i2c1_rx (int adress){

  // - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
	// разрешение работы
	I2C1->CR1 |= I2C_CR1_PE;

        
	// формирование сигнала СТАРТ
	I2C1->CR1 |= I2C_CR1_START;
	while (!(I2C1->SR1 & I2C_SR1_SB)){} 	// окнчание формирования сигнала СТАРТ
	(void) I2C1->SR1;

	// передача адреса ведомого + запись
	I2C1->DR =  adress + 0;//0xA0
	while (!(I2C1->SR1 & I2C_SR1_ADDR)){} 	// ожидание окончания передачи адреса
	(void) I2C1->SR1;
	(void) I2C1->SR2;

	// передача адреса 10-й ячейки
	I2C1->DR = 10;
	while (!(I2C1->SR1 & I2C_SR1_BTF)){} 	// ждём окнчания передачи адреса

	// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
	// формирование сигнала ПОВТОРНЫЙ СТАРТ
	I2C1->CR1 |= I2C_CR1_START;
	while (!(I2C1->SR1 & I2C_SR1_SB)){}
	(void) I2C1->SR1;

	// передаём адрес ведомого + чтение
	I2C1->DR = adress + 1;//0xA1
	while (!(I2C1->SR1 & I2C_SR1_ADDR)){} // ждём
        
	(void) I2C1->SR1;
	(void) I2C1->SR2;
	while (!(I2C1->SR1 & I2C_SR1_RXNE)){}	// ждём окончания приёма данных
	eeprom_data = I2C1->DR; // считываем принятое значение
	I2C1->CR1 |= I2C_CR1_STOP; // формирование сигнала СТОП
  
}

void i2c1_rx2 (void){
        I2C1->CR1 |= I2C_CR1_START;
	while (!(I2C1->SR1 & I2C_SR1_SB)){}
	(void) I2C1->SR1;

	// адрес ведомого + запись
	I2C1->DR = 0xA0;
	while (!(I2C1->SR1 & I2C_SR1_ADDR)){}
	(void) I2C1->SR1;
	(void) I2C1->SR2;


	I2C1->DR = 10;
	while (!(I2C1->SR1 & I2C_SR1_BTF)){}

	// передаём данные
	I2C1->DR = ++eeprom_data;
	while (!(I2C1->SR1 & I2C_SR1_BTF)){}

	I2C1->CR1 |= I2C_CR1_STOP;
}

uint16_t Get_current (void){
  
