vehar/STM32L15x_prj_new/AN3413-Current_consumption_touch_sensing/src/main.c
}

uint16_t Get_time (void){
  
  
}




void Usart_init_vs_irq (void)
{
RCC->AHBENR  |= RCC_AHBENR_GPIOAEN; //тактирование порта
  
    PIN_CONFIGURATION(USART1_TX);
    PIN_CONFIGURATION(USART1_RX); 
    /*   
   GPIOA->MODER |= GPIO_MODER_MODER9_1; // PA9  AF  
   GPIOA->OTYPER &= ~ GPIO_OTYPER_OT_9; //out push-pull
   GPIOA->OSPEEDR |= GPIO_OSPEEDER_OSPEEDR9;//40 MHZ
   
   GPIOA->MODER &=~ GPIO_MODER_MODER10_1; // PA10 IN no pull-up no pull-down
   GPIOA->OSPEEDR |= GPIO_OSPEEDER_OSPEEDR10;//40 MHZ
   */
    
  RCC->APB2ENR |= RCC_APB2ENR_USART1EN;// тактирование модуля
 
  USART1->BRR  = (SystemCoreClock + 9600/2)/9600 ; // 0x9c4 ; baud rate 9600 f=24Mhz 
  USART1->CR1 |=  USART_CR1_RXNEIE; // RX Interrupt Enable 
 // USART1->CR1 |= USART_CR1_TCIE; // Transmission Complete Interrupt Enable
  USART1->CR1 |= USART_CR1_UE;//UART ENABLE
  USART1->CR1 |=USART_CR1_RE | USART_CR1_TE; // rx,tx enable
  
  NVIC_EnableIRQ(USART1_IRQn);// Enable IRQ
}


void send_to_usart(uint8_t data) {
  while(!(USART1->SR & USART_SR_TC)); 
  USART1->DR=data; 
}


void send_str_u(char * string) { //SEND STRING TO UART
uint8_t i=0;
  while(string[i]) {
  send_to_usart(string[i]);
  i++;
 }
send_to_usart('\r');
send_to_usart('\n');
}


void Spi2_init_vs_irq(void){
   RCC->AHBENR |= RCC_AHBENR_GPIOAEN | RCC_AHBENR_GPIOBEN; //Тактирование портов A, B
  //----------------------------------------------------------------------------  
  // /*
   //Линини SPI1 (Master)
  //PA12(MOSI), PA11(MISO), PA5(SCK), PA4(NSS) - AF, Push-Pull, AF5(SPI1)
  GPIOA->MODER |= GPIO_MODER_MODER12_1 | GPIO_MODER_MODER11_1 | GPIO_MODER_MODER5_1 | GPIO_MODER_MODER4_1; //Alternate function
  GPIOA->OTYPER &= ~(GPIO_OTYPER_OT_12 | GPIO_OTYPER_OT_11 | GPIO_OTYPER_OT_5 | GPIO_OTYPER_OT_4); //Push-Pull
  GPIOA->AFR[1] |= (5<<16 | 5<<12); //PA12 = AF5, PA11 = AF5
  GPIOA->AFR[0] |= (5<<20 | 5<<16); //PA5 = AF5, PA4 = AF5
  // */
  
  //Линии SPI2 (Slave)
  //PB15(MOSI), PB14(MISO), PB13(SCK), PB12(NSS) - AF, Push-Pull, AF5(SPI1)
  GPIOB->MODER |= GPIO_MODER_MODER15_1 | GPIO_MODER_MODER14_1 | GPIO_MODER_MODER13_1 | GPIO_MODER_MODER12_1; //Alternate function
  GPIOB->OTYPER &= ~(GPIO_OTYPER_OT_15 | GPIO_OTYPER_OT_14 | GPIO_OTYPER_OT_13 | GPIO_OTYPER_OT_11); //Push-Pull
  GPIOB->AFR[1] |= (5<<28 | 5<<24 | 5<<20 | 5<<16); //PB15, PB14, P13, PB12 = AF5 
  //---------------------------------------------------------------------------- 
  ///*
   //Настройка SPI1 (Master)
 // 8 бит данных, MSB передается первым, программный режим управления NSS, 
 // вывод NSS (PA4) разрешено использовать в качестве выхода
  RCC->APB2ENR |= RCC_APB2ENR_SPI1EN; //Тактирование модуля SPI1
  SPI1->CR1 |= (SPI_CR1_BR_0 | SPI_CR1_BR_1); //Baud rate = Fpclk/16 //if system clk =16MHz -> BR=1MHz
 // SPI1->CR1 |= SPI_CR1_CPOL; //Полярность тактового сигнала
 // SPI1->CR1 |= SPI_CR1_CPHA; //Фаза тактового сигнала ///????
  SPI1->CR1 |= SPI_CR1_DFF; //16 бит данных               ///?
 // SPI1->CR1 |= SPI_CR1_LSBFIRST; //LSB передается первым
  SPI1->CR1 |= SPI_CR1_SSM; //Программный режим NSS
  SPI1->CR1 |= SPI_CR1_SSI; //Аналогично состоянию, когда на входе NSS высокий уровень
  SPI1->CR2 |= SPI_CR2_SSOE; //Вывод NSS - выход управления slave select
   //SPI1->CR2 |= SPI_CR2_FRF;
  SPI1->CR1 |= SPI_CR1_MSTR; //Режим Master
  
 //  SPI1->CR2 |= SPI_CR2_TXEIE; /*!< Tx buffer Empty Interrupt Enable */
   SPI1->CR2 |= SPI_CR2_RXNEIE;  /*!< RX buffer Not Empty Interrupt Enable */
  
 // SPI1->CR1 |= SPI_CR1_SPE; //Включаем SPI1
 // NVIC_EnableIRQ(SPI1_IRQn);
 // */
  
  /*Настройка SPI2 (Slave)
  8 бит данных, MSB передается первым, аппаратный режим управления NSS, 
  вывод NSS (PB12) - вход*/
  RCC->APB1ENR |= RCC_APB1ENR_SPI2EN; //Тактирование модуля SPI2
  SPI2->CR1 |= SPI_CR1_DFF; //16 бит данных
 //SPI2->CR1 |= SPI_CR1_CPOL; //Полярность тактового сигнала
 // SPI2->CR1 |= SPI_CR1_CPHA; //Фаза тактового сигнала
  //SPI2->CR1 |= SPI_CR1_LSBFIRST; //LSB передается первым
  SPI2->CR1 |= SPI_CR1_SSM; //Программное управление входом NSS
  SPI2->CR1 &= ~SPI_CR1_MSTR; //Режим Slave
  
 //  SPI2->CR2 |= SPI_CR2_TXEIE; /*!< Tx buffer Empty Interrupt Enable */
   SPI2->CR2 |= SPI_CR2_RXNEIE;  /*!< RX buffer Not Empty Interrupt Enable */
  
  SPI2->CR1 |= SPI_CR1_SPE; //Включаем SPI2  
  NVIC_EnableIRQ(SPI2_IRQn);
}

void recieve_from_spi_1(void) {
  while(!(SPI1->SR & SPI_SR_RXNE)); //Ожидаем окончания приема данных модулем SPI1 (RXNE =1 - приемный буфер содержит данные)
  temp = SPI1->DR;//Считываем данные из приемного буфера SPI1. При этой операции происходит очистка буфера и сброс флага RXNE
}


/*Функция обмена данными между модулями SPI1 и SPI2.
В качестве аргумента при вызове функции передаются числа 0x01 или 0x03, 
которые затем записываются в буфер передатчика SPI2.
Значение, записываемое в буфер передатчика SPI1 неважно, в данном случае 0x0F.
После обмена байтами данных, значение, принятое модулем SPI1 считывается из 
регистра данных SPI1_DR в переменную temp*/
void spi_exchange(uint8_t send_data)
{
  SPI2->DR = send_data; //Пишем в буфер передатчика SPI2 
  SPI1->DR = 0x0F; //Пишем в буфер передатчика SPI1. После этого стартует обмен данными
  recieve_from_spi_1();
}

void ADC_init(void){
     RCC->AHBENR  |= RCC_AHBENR_GPIOAEN; //тактирование порта
     //Predefined channels
     //PIN_CONFIGURATION( ADC_CH_10); //C0
     //PIN_CONFIGURATION( ADC_CH_11); //C1
     
     PIN_CONFIGURATION( ADC_CH_3); //A2
     PIN_CONFIGURATION( ADC_CH_4); //A3
  
  RCC->CR |= RCC_CR_HSION; //Включаем внутренний генератор HSI - 16МГц
  while(!(RCC->CR&RCC_CR_HSIRDY)); //Ждем его стабилизации
  RCC->APB2ENR |= RCC_APB2ENR_ADC1EN; //Разрешаем тактирование АЦП
  //----------------------------------------------------------------------------
 // ADC1->CR2 |=ADC_CR2_DELS_0; //: Until the converted data have been read 
    ADC1->CR1 |= ADC_CR1_RES_1; //resolution 8 bit
    
    /*Последовательность из0мерений (исспользуется только одиночное преобразование)*/
               /// ADC1->SQR5 |= ADC_SQR1_L_0;
               // ADC1->SQR5 |= ADC_SQR5_SQ1_1 | ADC_SQR5_SQ1_3; //10 CH
               // ADC1->SQR5 |= ADC_SQR5_SQ2_0 | ADC_SQR5_SQ2_1 | ADC_SQR5_SQ2_3; //11 CH
 
  ADC1->CR2 &= ~ADC_CR2_ALIGN; //Выравнивание результата вправо 
  //----------------------------------------------------------------------------
  ADC1->CR2 |= ADC_CR2_ADON; //Включаем АЦП
  while(!(ADC1->SR&ADC_SR_ADONS)); //Ждем готовности АЦП
  //----------------------------------------------------------------------------
   ADC1->CR1 |= ADC_CR1_EOCIE; /*!< Interrupt enable for EndOfConversion */
   NVIC_EnableIRQ(ADC1_IRQn);
       
