vehar/STM32L15x_prj_new/AN3413-Current_consumption_touch_sensing/src/main.c
   // ADC1->CR2 |= ADC_CR2_SWSTART;  /*!< Start Conversion of regular channels */
   //ADC1->CR2 |= ADC_CR2_JSWSTART;  /*!< Start Conversion of injected channels */    
}

void ADC_measure(char ch){
 ADC1->SQR5 = 0; 
switch(ch)
 {
  case 10:
      ADC1->SQR5 |= ADC_SQR5_SQ1_1 | ADC_SQR5_SQ1_3; //10 CH
      break;
  case 11:
    ADC1->SQR5 |= ADC_SQR5_SQ1_0 | ADC_SQR5_SQ1_1 | ADC_SQR5_SQ1_3; //11 CH
      break;
      
  case 3:
    //  ADC1->SQR5 |= ADC_SQR5_SQ1_1 | ADC_SQR5_SQ1_3; //3 CH
      break;
  case 4:
   // ADC1->SQR5 |= ADC_SQR5_SQ1_0 | ADC_SQR5_SQ1_1 | ADC_SQR5_SQ1_3; //4 CH
      break;
      
  default : ADC1->SQR5 |= ADC_SQR5_SQ1_1 | ADC_SQR5_SQ1_3; //10 CH
 }   
ADC1->CR2 |= ADC_CR2_SWSTART;  /*!< Start single Conversion of regular channels */
}


//!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
//Точная частота камня пока не известна, похоже около 2 Мгц
//!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
void DM_spi_test(void){
  
}

//My funktions_end

////////////////////////////////////////////
/////////////////NOTES_START///////////////

 //----------------------------------------------------------------
        //ENEBLE INTERRUPTS
        //1
 //__enable_irq ();   //Global enable
       //2
// NVIC_EnableIRQ(EXTI1_IRQn); // Enable IRQn
 //NVIC_DisableIRQ(EXTI1_IRQn); // Disable IRQn      
      //3 настроить и разрешить конкретные прерывания в периферии
 //EXTI->IMR |=(EXTI_IMR_MR1 | EXTI_IMR_MR2); //для выводов 1 и 2
// EXTI->RTSR |= EXTI_RTSR_TR1 | EXTI_FTSR_TR2 ; //конфигурация - по растущему и падающему фронтам
 //-------------------------------------------------------------------
 
/////////////////NOTES_END////////////////// 
////////////////////////////////////////////

 
 

//////////////////////////////////////////
//////////////////////////////////////////
//From examlpe start

/*
  bool StanbyWakeUp ;
  float Current_STBY;
    
  Int_CurrentSTBY = Current_Measurement();    //store Standby Current
  if (PWR_GetFlagStatus(PWR_FLAG_SB) != RESET)    //Check if the StandBy flag is set 
  {
     //System resumed from STANDBY mode 
     //Clear StandBy flag 
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_PWR,ENABLE);
    PWR_ClearFlag(PWR_FLAG_SB);    
    StanbyWakeUp = TRUE;  //set StandbyWakeup indicator
  } else
  {
    StanbyWakeUp = FALSE;  //Reset StandbyWakeup indicator 
  } 
  
  RCC_Configuration();   //Configure Clocks for Application need 
  PWR_VoltageScalingConfig(PWR_VoltageScaling_Range1);    //Set internal voltage regulator to 1.8V 
  while (PWR_GetFlagStatus(PWR_FLAG_VOS) != RESET) ;   //Wait Until the Voltage Regulator is ready 
  

  Init_GPIOs();    //Init I/O ports 
  ADC_Icc_Init();   //Initializes ADC 
  enableInterrupts();	   //Enable General interrupts 
  
 
  //TSL_Init();   //Init Touch Sensing configuration  
  
   // Multichanel Key settings
  sMCKeyInfo[0].Setting.b.IMPLEMENTED = 1;
  sMCKeyInfo[0].Setting.b.ENABLED = 1;
  sMCKeyInfo[0].DxSGroup = 0x00; 
 
   //Initializes the LCD glass 
  //LCD_GLASS_Init();
  //LCD_GLASS_DisplayString("HELLO");
        
    KeyPressed = FALSE;  //Reset Keypressed flag used in interrupt and Scrollsentence 
    UserButton = TRUE;  //user button activ   

   //Check if User button press at Power ON  	
  if ((USERBUTTON_GPIO_PORT->IDR & USERBUTTON_GPIO_PIN) != 0x0)
  {
   Bias_measurement();   //Measure operational amplifier bias current and store value in EІProm for application need
  }

   //Standard application startup 

  if ( !StanbyWakeUp )
  {    
        AUTOTEST(FALSE) ; // Reset autotest flag stored in memory 
    /// Display Welcome message  
   //LCD_GLASS_ScrollSentence(" ** STM32L-DISCOVERY **",1,SCROLL_SPEED);
    if (!KeyPressed)
    {
       // if welcome message not skipped Display blinking message JP1 ON
      LCD_BlinkConfig(LCD_BlinkMode_AllSEG_AllCOM,LCD_BlinkFrequency_Div512);
      LCD_GLASS_DisplayString("JP1 EE");
      LCD_BlinkConfig(LCD_BlinkMode_Off,LCD_BlinkFrequency_Div32);	
    }
  // Wake up from Standby or autotest 
  }  else  {
    //Check Autotest value stored in flash to get wakeup context
    if (Auto_test)
    {
      auto_test_part2();      //Wake UP: Return of RESET by Auto test
    } else {
      //Wake UP: Return of RESET by Current STAND BY measurement
      LCD_GLASS_ScrollSentence("     STANDBY WAKEUP",1,SCROLL_SPEED);
      //Substract bias current from operational amplifier
      if ( Int_CurrentSTBY > Bias_Current )
        Int_CurrentSTBY -= Bias_Current;
      Current_STBY = Int_CurrentSTBY * Vdd_appli()/ADC_CONV;  
      Current_STBY *= 20L;
      display_MuAmp((uint32_t)Current_STBY); // Wait for user button press to continue 
      while(!KeyPressed);
    }
  }
  
  KeyPressed = FALSE;    //Reset KeyPress Flag 
  //BAR0_OFF;    //Clear LCD bars 
   //Switch off the leds
 // GPIO_HIGH(LD_GPIO_PORT,LD_GREEN_GPIO_PIN);	
  GPIO_LOW(LD_GPIO_PORT,LD_BLUE_GPIO_PIN);	
  state_machine = STATE_VREF ; //Set application state machine to VREF state 
  
*/


  /*Until application reset*/
 /*
  while (1)
  {
    if (Auto_test)  auto_test();    //run autotest if requested by the user 
     //Perform Actions depending on current application State  
    switch (state_machine)
    {
         //VREF State : Display VRef value 
        case STATE_VREF:
          GPIO_TOGGLE(LD_GPIO_PORT,LD_BLUE_GPIO_PIN);
          GPIO_TOGGLE(LD_GPIO_PORT,LD_GREEN_GPIO_PIN);
          Vref_measure();
          TEMPO ;
        break;       
         //Slider Value State : Display the TS slider value 
        case STATE_SLIDER_VALUE:
          TSL_Action();
          Slider_value();   
        break;       
         //Slider button State : Display the curent TS button pressed  
        case STATE_SLIDER_BUTTON: 
          TSL_Action();
          Button_value();         
          break;        
         //ICC RUN State : ICC mesurements in Run and Sleep modes   
        case STATE_ICC_RUN:
          LCD_GLASS_DisplayString(" RUN  ");         
          Icc_RUN();
          LCD_GLASS_DisplayString(" SLEEP ");
          Icc_SLEEP(); 
        break;        
         //ICC LOW POWER RUN State : ICC mesurements in LowPower run and LowPower Sleep modes 
        case STATE_ICC_LP_RUN:
          LCD_GLASS_DisplayString("LP RUN");     
          Icc_LPRUN();
          LCD_GLASS_DisplayString("LP SLP");
          Icc_LPSLEEP();             
        break;        
         //ICC STOP  State : ICC mesurements in Stop and STOP NoRTC modes 
        case STATE_ICC_STOP:
          LCD_GLASS_DisplayString(" STOP ");         
          Icc_STOP();       
          LCD_GLASS_DisplayString("SP-NRTC");         
          Icc_Stop_NoRTC();                
          break;      
         //ICC Standby  State : ICC mesurements in Standby mode 
        case STATE_ICC_STBY:
          LCD_GLASS_DisplayString("STBY  ");          
        ADC_Icc_Test(MCU_STBY);
         //Following break never performed dues to software reset in previous function        
        break;          
         //for safe: normaly never reaches  			
        default:
          LCD_GLASS_Clear();
          LCD_GLASS_DisplayString("ERROR");
        break;
      }     
      KeyPressed = FALSE; //Reset KeyPress flag
    }
*/

