vehar/STM32L15x_prj_new/AN3413-Current_consumption_touch_sensing/src/main.c
//From examlpe _end
//////////////////////////////////////////
//////////////////////////////////////////


uint8_t i=0; 


void TIM2_IRQHandler(void)
{   
    TIM2->SR &= ~TIM_SR_UIF; //Clean UIF Flag
  //  SET(ADC_start_flag);
  
    
    //if(PIN_SIGNAL(LED_GREEN)){ PIN_OFF(LED_GREEN);}
   // else  PIN_ON(LED_GREEN) ;
    
    if (1 == (i++ & 0x01)) {
      GPIOB->BSRRH |= GPIO_BSRR_BS_7;  // Reset PB7 bit
    } else {
      GPIOB->BSRRL |= GPIO_BSRR_BS_7;   // Set PB7 bit
    }    
  
    
  //  send_str_u("Timer2_IRQ!\n");
}

void TIM3_IRQHandler(void)
{   
  if (TIM_GetITStatus(TIM3, TIM_IT_Update) != RESET)
  {
    TIM_ClearITPendingBit(TIM3, TIM_IT_Update);

    //if (!capture_is_first)
    //  capture_is_ready = 1;

   // capture_is_first = 0;
    /* В бите TIM_CR1_DIR регистра TIM3_CR1 хранится
       направление вращения энкодера, запоминаем его. */
   // captured_direction = (TIM3->CR1 & TIM_CR1_DIR ? FORWARD : BACKWARD);
  }

  
  // TIM3->SR &= ~TIM_SR_UIF; //Clean UIF Flag
 //  TIM3->SR &= ~TIM_SR_TIF; //Clean TIF Flag
 //  TIM3->SR &= ~TIM_SR_CC4IF;
  // TIM3->SR &= ~TIM_SR_CC3IF;
  // send_str_u("Tim3_IRQ!\n");
}

//------------------------------------------------------------------------------
uint8_t j=0; 

/*
void EXTI0_IRQHandler(void)
{
  EXTI->PR |= EXTI_PR_PR0; // сброс флага прерывания
 // t^=1;
//  SET(A_flag);
  
    send_str_u("You!");
  
 if (1 == (j++ & 0x01)) {
        //GPIOB->BSRR |= GPIO_BSRR_BS_6;   // Set PB4 bit
       // GPIOB->BSRR |= GPIO_BSRR_BR_7;  // Reset PB5 bit
      
   //    GPIOB->ODR &= ~GPIO_ODR_ODR_6  ;
    }
 else {
      // GPIOB->BSRR |= GPIO_BSRR_BS_7;   // Set PB5 bit
       // GPIOB->BSRR |= GPIO_BSRR_BR_6;  // Reset PB4 bit 
 
   //   GPIOB->ODR |= GPIO_ODR_ODR_6  ;
          }
}
*/
uint16_t debug_spi_t = 1; 

 void EXTI0_IRQHandler(void)
{
  /* Disable general interrupts */
  disableInterrupts();
  
  /* UserButton usage activated*/ 
  if (!UserButton)
  {
    UserButtonHandler();
    SPI1->DR = debug_spi_t*2;//debug
  }
  else 
  {
    /*Idd_Wakeup detected */
    Idd_WakeUP = TRUE;
  }  
  EXTI_ClearITPendingBit(EXTI_Line0);
  enableInterrupts();
}
 
// обработчик EXTI 1
void EXTI1_IRQHandler(void)
{
uint32_t	i;
EXTI->PR |= EXTI_PR_PR1;  // сброс флага прерывания
 SET(B_flag);
}

// обработчик EXTI 2
void EXTI2_IRQHandler(void)
{
uint32_t	i;
EXTI->PR |= EXTI_PR_PR2;  // сброс флага прерывания
 SET(C_flag);
}


// обработчик EXTI 3
void EXTI3_IRQHandler(void)
{
uint32_t	i;
EXTI->PR |= EXTI_PR_PR3;  // сброс флага прерывания
 SET(D_flag);
 
send_str_u("ENC_btn_pressed!");
}


// обработчик EXTI 4
void EXTI4_IRQHandler(void)
{
uint32_t	i;
EXTI->PR |= EXTI_PR_PR4;  // сброс флага прерывания
 SET(E_flag);
}

/*
// обработчик EXTI 9-5
void EXTI9_5_IRQHandler(void)
{
uint32_t	i;
EXTI->PR |= EXTI_PR_PR5;  // сброс флага прерывания
 SET(F_flag);
}
*/

void EXTI9_5_IRQHandler(void)
{
  /* Disable general interrupts */
  disableInterrupts();
  
  OutData.flags = BTN_PRESSED;
  OutData.btn_state = 128; //Indicates encoder btn pressed
    //UserButtonHandler();

  EXTI_ClearITPendingBit(EXTI_Line5);
  enableInterrupts();
}

// обработчик EXTI 10-15
void EXTI15_10_IRQHandler(void)
{
uint32_t	i;
EXTI->PR |= EXTI_PR_PR10;  // сброс флага прерывания
 SET(ENKODER_flag);
}



void USART1_IRQHandler (void){

  if (USART1->SR & USART_SR_RXNE) {
    usart_data=USART1->DR;   
//USART1->DR = USART1->DR; //ECHO MODE
   UsartRxBuffer[usart1_rx_bit]=usart_data; //put recieved byte in buffer
   usart1_rx_bit++; //buffer count ++ 
  }
  USART1->SR |=  USART_SR_TC; //clear flags  
  USART1->SR |=  USART_SR_RXNE; 
}



void SPI1_IRQHandler (void){
      send_str_u("S");
 
  if( SPI1->SR & SPI_SR_RXNE){ // RXNE =1   Receive buffer contains data 
       //  GPIOB->BSRRH |= GPIO_BSRR_BS_7;   //RESet PB6 bit
   spi1_data = SPI1->DR;//Считываем данные из приемного буфера SPI1. При этой операции происходит очистка буфера и сброс флага RXNE 
   spi1_buf[spi1_bit]=spi1_data; //Помещаем принятый байт в буфер.
   temp=spi1_data;
   spi1_bit++; //Наращиваем счётчик байтов буфера. 
  }
  
   if( SPI2->SR & SPI_SR_TXE){ // (TXE =1 - Transmit buffer empty))
       //  send_str_u("SPI1_IRQ  Transmit buffer empty");
     //   GPIOB->BSRRL |= GPIO_BSRR_BS_7;   // Set PB6 bit
  }
}


void SPI2_IRQHandler (void)
{
#ifdef DEBUG  
    send_str_u("SPI2_IRQ");
#endif  
  if( SPI2->SR & SPI_SR_RXNE){ // (RXNE =1 - приемный буфер содержит данные))
  
       //  GPIOB->BSRRH |= GPIO_BSRR_BS_6;   //RESet PB6 bit
        
    temp = SPI2->DR;//Считываем данные из приемного буфера SPI2. При этой операции происходит очистка буфера и сброс флага RXNE
   // send_to_usart(temp); //?/??    
    USART1->DR = temp; 
    
    SPI2->DR = (short)OutData.encoder_state; //Пишем в буфер передатчика SPI2 ?
   // send_to_usart(Encoder_curr_pos);
    
  }
   if( SPI2->SR & SPI_SR_TXE){ // (TXE =1 - Transmit buffer empty))

     //   GPIOB->BSRRL |= GPIO_BSRR_BS_6;   // Set PB6 bit
  }
}


void ADC1_IRQHandler (void){
  if(ADC1->SR & ADC_SR_EOC) { /*!< End of conversion */
    ADC_data=ADC1->DR;
    
    send_str_u("ADC");
   send_to_usart(ADC_data);
   }
}

/* In CustI2C
void I2C1_EV_IRQHandler (void){}*/


///////////////////////////////////////////////////////





//Мусор

/*
//Test
#define   ENCODER_TIM             TIM3
// Tim clock division is 1, so the FDTS = 72MHz //?
// Fsample = FDTS/4 = 18MHz, and sample 6 times
#define   ENC_FILTER              6
#define   MAX_COUNT               255
#define   ENCODER_TIM_PERIOD      (MAX_COUNT*3)

 // definitions for the quadrature encoder pins

// Left Motor Channels
#define ENC_1CH_PIN               GPIO_Pin_7
#define ENC_2CH_PIN               GPIO_Pin_6
#define ENC_GPIO_PORT         GPIOA
#define ENC_GPIO_CLK          RCC_AHB1Periph_GPIOA
#define ENC_1CH_SOURCE            GPIO_PinSource7
#define ENC_2CH_SOURCE            GPIO_PinSource6
#define ENC_AF                GPIO_AF_TIM3

// determine the timers to use
#define ENC_TIMER_CLK          RCC_APB1Periph_TIM3

