vehar/STM32L15x_prj_new/AN3413-Current_consumption_touch_sensing/src/main.c
#define LEFT_COUNT()            ENCL_TIMER->CNT
#define RIGHT_COUNT()           ENCR_TIMER->CNT
void Enc_Init_3ver(void)
{  
  GPIO_InitTypeDef GPIO_InitStructure;
  RCC->APB1ENR |= RCC_APB1ENR_TIM3EN;//RCC_AHB1PeriphClockCmd (ENC_GPIO_CLK, ENABLE);
  
   // now configure the pins themselves
  // they are all going to be inputs with pullups
  GPIO_StructInit (&GPIO_InitStructure);
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_DOWN; //GPIO_PuPd_UP changed for GPIO_PuPd_DOWN
  GPIO_InitStructure.GPIO_Pin = ENC_1CH_PIN | ENC_2CH_PIN;
  GPIO_Init (ENC_GPIO_PORT, &GPIO_InitStructure);
  

  // Connect the pins to their Alternate Functions
  GPIO_PinAFConfig (ENC_GPIO_PORT, ENC_1CH_SOURCE | ENC_1CH_SOURCE, ENC_AF);

  // Timer peripheral clock enable
  RCC_APB1PeriphClockCmd (ENC_TIMER_CLK, ENABLE);

  // set them up as encoder inputs
  // set both inputs to rising polarity to let it use both edges
  TIM_EncoderInterfaceConfig (ENCODER_TIM, 
                              TIM_EncoderMode_TI12, 
                              TIM_ICPolarity_Falling, //Rising
                              TIM_ICPolarity_Falling);//Rising
    TIM_SetAutoreload (ENC_TIMER, 0x00ff);

  // turn on the timer/counters
  TIM_Cmd (ENC_TIMER, ENABLE);
  //encodersReset();
}*/


/**
  * @brief  Inserts a delay time.
  * @param  nTime: specifies the delay time length, in 10 ms.
  * @retval None
*/  
void Delay(uint32_t nTime)
{
  TimingDelay = nTime;
  while(TimingDelay != 0); 
}

/**
  * @brief  Decrements the TimingDelay variable.
  * @caller SysTick interrupt Handler 
  * @param  None
  * @retval None
*/  
void TimingDelay_Decrement(void)
{
  if (TimingDelay != 0x00)
    TimingDelay--;
}

#ifdef  USE_FULL_ASSERT

/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
*/  
void assert_failed(uint8_t* file, uint32_t line)
{ 
   //User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) ;
   //Infinite loop 
  while (1);
}

#endif